app/views/articles/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

  <div class="profile-pic <%= "color-change" if params[:user_id] == "2" %>"><%= User.find(params[:user_id]).name[0] %></div>

SELECT "users".* FROM "users"
---
</div>
  <% User.all.each do |i| %>