app/controllers/anals_controller.rb

SELECT "anals".* FROM "anals" WHERE "anals"."user_id" = $1 ORDER BY count DESC  [["user_id", 1]]
SELECT MAX("anals"."count") FROM "anals" WHERE "anals"."user_id" = $1  [["user_id", 1]]
---
  def index
    @anals = Anal.where(user_id: params[:user_id]).order('count DESC')

INSERT INTO "anals" ("name", "user_id", "created_at", "updated_at", "count") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "solo "], ["user_id", 1], ["created_at", "2022-12-06 09:08:42.914885"], ["updated_at", "2022-12-06 09:08:42.914885"], ["count", 1]]
---
  def create
    @anal = Anal.new(anal_params)
    @anal.user_id = params[:user_id]

    respond_to do |format|
      if @anal.save

UPDATE "anals" SET "name" = $1, "updated_at" = $2, "count" = $3 WHERE "anals"."id" = $4  [["name", "the"], ["updated_at", "2022-12-05 20:15:57.992216"], ["count", 5], ["id", 115]]
---
  def update
    respond_to do |format|
      if @anal.update(anal_params)

SELECT "anals".* FROM "anals" WHERE "anals"."user_id" = $1 ORDER BY count DESC  [["user_id", 1]]
---
  def destroy
    Anal.where(user_id: params[:user_id]).order('count DESC').destroy_all

DELETE FROM "anals" WHERE "anals"."id" IN (SELECT "anals"."id" FROM "anals" WHERE "anals"."user_id" = $1 ORDER BY count DESC)  [["user_id", 1]]
---
  def remove_all
    Anal.where(user_id: params[:user_id]).order('count DESC').delete_all

SELECT "anals".* FROM "anals" WHERE "anals"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
    def set_anal
      @anal = Anal.find(params[:id])