app/controllers/articles_controller.rb

  def index
    @articles = Article.where(user_id: params[:user_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]

  def show
    @k = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)
    @article.user_id = params[:user_id]

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("name", "paragraph", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ded"], ["paragraph", "ded"], ["user_id", 1], ["created_at", "2022-12-04 16:20:39.065627"], ["updated_at", "2022-12-04 16:20:39.065627"]]