app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Fedya"], ["created_at", "2022-12-04 14:39:51.802718"], ["updated_at", "2022-12-04 14:39:51.802718"]]