app/models/anal.rb

SELECT "anals".* FROM "anals" WHERE "anals"."name" = $1 LIMIT $2  [["name", "here"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "anals" WHERE "anals"."name" = $1  [["name", "where is my books"]]
---

  before_save do
    anals = Anal.where(name: self.name)
    self.count += anals.count if anals.count >= 1